In [1]:
import pandas as pd

In [2]:
import sqlalchemy

In [3]:
# !pip install pymysql

In [4]:
engine = sqlalchemy.create_engine("mysql+pymysql://root:regmi951@localhost:3306/kshitiz")

In [5]:
df = pd.read_sql_table('student',engine)

In [6]:
df

      name college
0  kshitiz    MBMC
1   sushil    MBMC
2    shyam     ace

In [7]:
df = pd.read_sql_table('student', engine, columns=["name"])

In [8]:
df

      name
0  kshitiz
1   sushil
2    shyam

In [9]:
df.rename(columns={
    'name': 'Name',
    
}, inplace=True)
df

      Name
0  kshitiz
1   sushil
2    shyam

In [10]:
df = pd.read_sql('student',engine)

In [11]:
df

      name college
0  kshitiz    MBMC
1   sushil    MBMC
2    shyam     ace

In [12]:
query = ' select name from student '

In [13]:
 pd.read_sql(query,engine)

      name
0  kshitiz
1   sushil
2    shyam